{
  "title": "Acerca de MaxIOFS",
  "version": "Versión",
  "documentation": "Documentación",
  "support": "Soporte",
  "license": "Licencia",
  "description": "Descripción",
  "descriptionText": "MaxIOFS es un sistema de almacenamiento de objetos de alto rendimiento compatible con S3, construido con Go y React. Diseñado para ser simple, portable y desplegable como un binario único con una interfaz web moderna embebida. Cuenta con soporte completo de multi-tenancy, almacenamiento de metadatos con BadgerDB, y compatibilidad completa con la API S3 con más de 40 operaciones incluyendo operaciones masivas, bloqueo de objetos y gestión avanzada de buckets.",
  "buildDate": "Fecha de Compilación",
  "status": "Estado",
  "beta": "Beta",
  "leadDeveloper": "Desarrollador Principal",
  "mainDeveloper": "Desarrollador Principal",
  "mainDeveloperDescription": "Proyecto desarrollado completamente por Aluisco Ricardo. MaxIOFS nació como una solución para proporcionar almacenamiento de objetos compatible con S3 de nivel empresarial de una manera simple y eficiente, con soporte completo multi-tenant, almacenamiento de metadatos de alto rendimiento usando BadgerDB, y características de seguridad listas para producción.",
  "keyFeatures": "Características Principales",
  "featureS3Compatible": "Compatible con S3",
  "featureS3CompatibleDesc": "Implementación completa de la API S3 con más de 40 operaciones incluyendo cargas multiparte, URLs prefirmadas y operaciones masivas (hasta 1000 objetos)",
  "featureMultiTenant": "Multi-Tenant",
  "featureMultiTenantDesc": "Aislamiento completo de tenants con cuotas configurables, eliminaciones en cascada, validación de eliminación y visibilidad cross-tenant para administradores globales",
  "featureSecurity": "Seguridad y Cifrado",
  "featureSecurityDesc": "Cifrado en reposo AES-256-CTR, autenticación JWT + 2FA, AWS Signature v2/v4, registro de auditoría completo (más de 20 tipos de eventos), listo para cumplimiento normativo (GDPR, SOC 2, HIPAA, ISO 27001)",
  "featurePerformance": "Alto Rendimiento",
  "featurePerformanceDesc": "Almacenamiento de metadatos BadgerDB v4 con lógica de reintentos de transacciones, eliminación metadata-first, y probado bajo estrés con más de 7000 objetos usando MinIO Warp",
  "featureSingleBinary": "Binario Único",
  "featureSingleBinaryDesc": "Empaquetado como un ejecutable único con frontend React embebido, sin dependencias externas y despliegue fácil",
  "featureModernUI": "Interfaz Moderna",
  "featureModernUIDesc": "Interfaz React 19 + TypeScript con soporte para modo oscuro, métricas en tiempo real, diseño responsive y características completas de gestión",
  "featureAdvancedS3": "Características Avanzadas de S3",
  "featureAdvancedS3Desc": "Object Lock (WORM), Versionado de Buckets, Políticas de Buckets (JSON), CORS, reglas de Ciclo de Vida, Etiquetado de Objetos y ACLs de Objetos",
  "featureBulkOperations": "Operaciones Masivas",
  "featureBulkOperationsDesc": "API DeleteObjects (hasta 1000 objetos), procesamiento secuencial para evitar conflictos, consistencia completa de metadatos",
  "featureDualStorage": "Almacenamiento Dual",
  "featureDualStorageDesc": "BadgerDB v4 para metadatos de objetos de alto rendimiento, SQLite para autenticación y registros de auditoría, sistema de archivos para almacenamiento de objetos con operaciones atómicas",
  "technologyStack": "Stack Tecnológico",
  "backend": "Backend",
  "frontend": "Frontend",
  "newFeaturesTitle": "Nuevas Características en v0.5.0-beta",
  "featureRealtimePushTitle": "Notificaciones Push en Tiempo Real (SSE)",
  "featureRealtimePushDesc": "Los Server-Sent Events entregan notificaciones de seguridad instantáneas a los usuarios administradores. Cuando las cuentas se bloquean debido a intentos de inicio de sesión fallidos, los administradores reciben alertas en tiempo real en el icono de campana de la barra superior con seguimiento de leídas/no leídas. Las notificaciones persisten a través de recargas de página y respetan el aislamiento de tenants (los administradores globales ven todas, los administradores de tenant solo ven las de su tenant).",
  "featureDynamicSecurityTitle": "Configuración de Seguridad Dinámica",
  "featureDynamicSecurityDesc": "Ajusta los umbrales de seguridad sin reiniciar el servidor a través de la página de Configuración. Configure la limitación de tasa basada en IP (predeterminado 5 intentos/minuto), umbral de bloqueo de cuenta (predeterminado 5 intentos fallidos) y duración de bloqueo (predeterminado 15 minutos). Los controles separados permiten diferentes límites para la limitación de tasa por IP vs bloqueo de cuenta, crucial para usuarios detrás de proxies.",
  "featureGlobalBucketsTitle": "Unicidad Global de Buckets - Compatible con AWS S3",
  "featureGlobalBucketsDesc": "Los nombres de buckets ahora son únicos globalmente en todos los tenants, coincidiendo con el comportamiento de AWS S3. Esto previene conflictos de nombres de buckets entre diferentes tenants y mejora significativamente la compatibilidad con clientes y herramientas S3 estándar. El cambio es completamente compatible hacia atrás sin requerir migración de datos.",
  "featureS3UrlsTitle": "URLs Compatibles con S3 (Prefirmadas y Compartidas)",
  "featureS3UrlsDesc": "Las URLs prefirmadas y URLs compartidas ahora usan el formato S3 estándar sin prefijo de tenant-id. Las URLs siguen el patrón /bucket/object en lugar de /tenant-id/bucket/object, proporcionando mejor compatibilidad con clientes S3, CDNs y herramientas externas. La resolución automática de tenant ocurre de manera transparente en el backend.",
  "featureBucketNotificationsTitle": "Notificaciones de Buckets (Webhooks)",
  "featureBucketNotificationsDesc": "Sistema de notificación de eventos compatible con AWS S3 con soporte de webhooks. Configure webhooks HTTP para eventos de objetos: ObjectCreated, ObjectRemoved y ObjectRestored. Las características incluyen mecanismo de reintentos (3 intentos), filtrado por prefijo/sufijo, encabezados HTTP personalizados y una interfaz amigable en la Consola Web para la gestión de reglas.",
  "featureAutoTenantTitle": "Resolución Automática de Tenant",
  "featureAutoTenantDesc": "El backend resuelve automáticamente la propiedad del bucket desde el nombre del bucket usando la nueva función GetBucketByName(). Esto permite que las URLs prefirmadas funcionen sin contexto de tenant y mantiene el aislamiento multi-tenant mientras usa formatos de URL S3 estándar. Todas las operaciones S3 permanecen transparentes para los clientes.",
  "featureBugFixesTitle": "Correcciones Críticas de Errores",
  "featureBugFixesDesc": "Se corrigió el doble conteo del limitador de tasa (bloqueaba en 3 en lugar de 5 intentos), el contador de intentos fallidos que no se restablecía después del bloqueo, la página de seguridad que no mostraba usuarios bloqueados, la ejecución de callbacks SSE, la detección de tokens del frontend y la persistencia del estado del modal de URL prefirmada. Todas las correcciones mejoran la estabilidad del sistema y la experiencia del usuario.",
  "developedWithPassion": "Desarrollado con pasión por Aluisco Ricardo",
  "copyright": "© 2024-2026 MaxIOFS"
}
