{
  "title": "About MaxIOFS",
  "version": "Version",
  "documentation": "Documentation",
  "support": "Support",
  "license": "License",
  "description": "Description",
  "descriptionText": "MaxIOFS is a high-performance S3-compatible object storage system built with Go and React. Designed to be simple, portable, and deployable as a single binary with an embedded modern web interface. Features full multi-tenancy support, BadgerDB-powered metadata storage, and comprehensive S3 API compatibility with 40+ operations including bulk operations, object lock, and advanced bucket management.",
  "buildDate": "Build Date",
  "status": "Status",
  "beta": "Beta",
  "leadDeveloper": "Lead Developer",
  "mainDeveloper": "Main Developer",
  "mainDeveloperDescription": "Project entirely developed by Aluisco Ricardo. MaxIOFS was born as a solution to provide enterprise-grade S3-compatible object storage in a simple and efficient way, with complete multi-tenant support, high-performance metadata storage using BadgerDB, and production-ready security features.",
  "keyFeatures": "Key Features",
  "featureS3Compatible": "S3 Compatible",
  "featureS3CompatibleDesc": "Full S3 API implementation with 40+ operations including multipart uploads, presigned URLs, and bulk operations (up to 1000 objects)",
  "featureMultiTenant": "Multi-Tenant",
  "featureMultiTenantDesc": "Complete tenant isolation with configurable quotas, cascading deletes, deletion validation, and global admin cross-tenant visibility",
  "featureSecurity": "Security & Encryption",
  "featureSecurityDesc": "AES-256-CTR encryption at rest, JWT + 2FA authentication, AWS Signature v2/v4, comprehensive audit logging (20+ event types), compliance-ready (GDPR, SOC 2, HIPAA, ISO 27001)",
  "featurePerformance": "High Performance",
  "featurePerformanceDesc": "BadgerDB v4 metadata store with transaction retry logic, metadata-first deletion, and stress-tested with 7000+ objects using MinIO Warp",
  "featureSingleBinary": "Single Binary",
  "featureSingleBinaryDesc": "Packaged as a single executable with embedded React frontend, no external dependencies, and easy deployment",
  "featureModernUI": "Modern UI",
  "featureModernUIDesc": "React 19 + TypeScript interface with dark mode support, real-time metrics, responsive design, and comprehensive management features",
  "featureAdvancedS3": "Advanced S3 Features",
  "featureAdvancedS3Desc": "Object Lock (WORM), Bucket Versioning, Bucket Policies (JSON), CORS, Lifecycle rules, Object Tagging, and Object ACLs",
  "featureBulkOperations": "Bulk Operations",
  "featureBulkOperationsDesc": "DeleteObjects API (up to 1000 objects), sequential processing to avoid conflicts, complete metadata consistency",
  "featureDualStorage": "Dual Storage",
  "featureDualStorageDesc": "BadgerDB v4 for high-performance object metadata, SQLite for authentication & audit logs, filesystem for object storage with atomic operations",
  "technologyStack": "Technology Stack",
  "backend": "Backend",
  "frontend": "Frontend",
  "newFeaturesTitle": "New Features in v0.5.0-beta",
  "featureRealtimePushTitle": "Real-Time Push Notifications (SSE)",
  "featureRealtimePushDesc": "Server-Sent Events deliver instant security notifications to admin users. When accounts are locked due to failed login attempts, admins receive real-time alerts in the topbar bell icon with read/unread tracking. Notifications persist across page reloads and respect tenant isolation (global admins see all, tenant admins see only their tenant).",
  "featureDynamicSecurityTitle": "Dynamic Security Configuration",
  "featureDynamicSecurityDesc": "Adjust security thresholds without server restart via Settings page. Configure IP-based rate limiting (default 5 attempts/minute), account lockout threshold (default 5 failed attempts), and lockout duration (default 15 minutes). Separate controls allow different limits for IP rate limiting vs account lockout, crucial for users behind proxies.",
  "featureGlobalBucketsTitle": "Global Bucket Uniqueness - AWS S3 Compatible",
  "featureGlobalBucketsDesc": "Bucket names are now globally unique across all tenants, matching AWS S3 behavior. This prevents bucket name conflicts between different tenants and significantly improves compatibility with standard S3 clients and tools. The change is fully backward compatible with no data migration required.",
  "featureS3UrlsTitle": "S3-Compatible URLs (Presigned & Share)",
  "featureS3UrlsDesc": "Presigned URLs and Share URLs now use standard S3 format without tenant-id prefix. URLs follow the pattern /bucket/object instead of /tenant-id/bucket/object, providing better compatibility with S3 clients, CDNs, and external tools. Automatic tenant resolution happens transparently in the backend.",
  "featureBucketNotificationsTitle": "Bucket Notifications (Webhooks)",
  "featureBucketNotificationsDesc": "AWS S3-compatible event notification system with webhook support. Configure HTTP webhooks for object events: ObjectCreated, ObjectRemoved, and ObjectRestored. Features include retry mechanism (3 attempts), prefix/suffix filtering, custom HTTP headers, and a user-friendly Web Console interface for rule management.",
  "featureAutoTenantTitle": "Automatic Tenant Resolution",
  "featureAutoTenantDesc": "Backend automatically resolves bucket ownership from bucket name using new GetBucketByName() function. This enables presigned URLs to work without tenant context and maintains multi-tenant isolation while using standard S3 URL formats. All S3 operations remain transparent to clients.",
  "featureBugFixesTitle": "Critical Bug Fixes",
  "featureBugFixesDesc": "Fixed rate limiter double-counting (was blocking at 3 instead of 5 attempts), failed attempts counter not resetting after lockout, security page not showing locked users, SSE callback execution, frontend token detection, and presigned URL modal state persistence. All fixes improve system stability and user experience.",
  "developedWithPassion": "Developed with passion by Aluisco Ricardo",
  "copyright": "© 2024-2026 MaxIOFS"
}
